; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-2-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s2)
	(at package2 s1)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s0)
	(at package8 s1)
	(at package9 s2)
	(at package10 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 71)
	(= (time-to-walk p0-1 s0) 71)
	(= (time-to-walk s1 p0-1) 32)
	(= (time-to-walk p0-1 s1) 32)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 67)
	(= (time-to-walk p0-2 s0) 67)
	(= (time-to-walk s2 p0-2) 27)
	(= (time-to-walk p0-2 s2) 27)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 74)
	(= (time-to-walk p2-1 s2) 74)
	(= (time-to-walk s1 p2-1) 35)
	(= (time-to-walk p2-1 s1) 35)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 89)
	(= (time-to-drive s1 s0) 89)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 61)
	(= (time-to-drive s2 s1) 61)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 50)
	(= (time-to-drive s0 s2) 50)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at truck1 s2)
	(at truck4 s1)
	(at package1 s2)
	(at package2 s2)
	(at package3 s0)
	(at package4 s2)
	(at package5 s0)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s0)
	(at package10 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 12
2. (load-truck package4 truck4 s0)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 2 of 12
3. (load-truck package6 truck4 s0)
   deleted: (at package6 s0)
   added: (in package6 truck4)
   goals met: 2 of 12
4. (load-truck package7 truck4 s0)
   deleted: (at package7 s0)
   added: (in package7 truck4)
   goals met: 2 of 12
5. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 0 to 89
   goals met: 3 of 12
6. (unload-truck package6 truck4 s1)
   deleted: (in package6 truck4)
   added: (at package6 s1)
   goals met: 4 of 12
7. (load-truck package2 truck4 s1)
   deleted: (at package2 s1)
   added: (in package2 truck4)
   goals met: 4 of 12
8. (load-truck package8 truck4 s1)
   deleted: (at package8 s1)
   added: (in package8 truck4)
   goals met: 4 of 12
9. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 89 to 178
   goals met: 3 of 12
10. (unload-truck package8 truck4 s0)
   deleted: (in package8 truck4)
   added: (at package8 s0)
   goals met: 4 of 12
11. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 12
12. (drive-truck truck4 s0 s2 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 178 to 228
   goals met: 4 of 12
13. (unload-truck package2 truck4 s2)
   deleted: (in package2 truck4)
   added: (at package2 s2)
   goals met: 5 of 12
14. (unload-truck package4 truck4 s2)
   deleted: (in package4 truck4)
   added: (at package4 s2)
   goals met: 6 of 12
15. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 228 to 289
   goals met: 7 of 12
16. (load-truck package9 truck4 s2)
   deleted: (at package9 s2)
   added: (in package9 truck4)
   goals met: 7 of 12
17. (load-truck package10 truck4 s2)
   deleted: (at package10 s2)
   added: (in package10 truck4)
   goals met: 7 of 12
18. (load-truck package3 truck4 s2)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   goals met: 7 of 12
19. (unload-truck package7 truck4 s2)
   deleted: (in package7 truck4)
   added: (at package7 s2)
   goals met: 8 of 12
20. (drive-truck truck4 s2 s1 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 289 to 350
   goals met: 9 of 12
21. (unload-truck package10 truck4 s1)
   deleted: (in package10 truck4)
   added: (at package10 s1)
   goals met: 10 of 12
22. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 350 to 439
   goals met: 9 of 12
23. (unload-truck package9 truck4 s0)
   deleted: (in package9 truck4)
   added: (at package9 s0)
   goals met: 10 of 12
24. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 11 of 12
25. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 439 to 528
   goals met: 12 of 12
